{
	"pluginmetadataversion": 2,
	"name": "Kaitai UI Plugin",
	"type": ["ui"],
	"api": ["python2", "python3"],
	"description": "Browse hex with a tree view populated from Kaitai Struct formats.",
	"longdescription": "# Kaitai Struct Binary Ninja Plugin\n\nAuthor: Vector 35 Inc\n\nThis UI plugin allows you to browse a hex dump within Binary Ninja with a tree view informed by [Kaitai Struct](https://kaitai.io/).\n\n![](https://github.com/Vector35/kaitai/blob/master/media/kaitai.gif?raw=true)\n\n## Description:\n\nThis wires up Kaitai Struct as a parsing library to produce templated dissection of binary files. Of course, this concept itself isn’t new. Plenty of great tools like 010, Hexinator and Synalyze It! have this feature (last two by the same company for different platforms). Thanks to the Kaitai Project not only for the project in general, but also for working with us to resolve some small issues while we were developing the plugin.\n\n## Required Dependencies\n\nThere are no external dependencies for this plugin. All of the Kaitai formats are precompiled to Python for self-contained use.\n\n",
	"license": {
		"name": "MIT",
		"text": "Copyright (c) 2019 Vector 35 Inc\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
	},
	"platforms" : ["Darwin", "Linux", "Windows"],
	"installinstructions" : {
		"Darwin" : "no special instructions, package manager is recommended",
		"Linux" : "no special instructions, package manager is recommended",
		"Windows" : "no special instructions, package manager is recommended"
	},
	"dependencies": {
	},
	"version": "1.1",
	"author": "Vector 35 Inc",
	"minimumbinaryninjaversion": 1200
}
